In [47]:
import pandas as pd

In [48]:
df=pd.read_csv('data/Titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [49]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  34.5   7.8292
1         1       3  female  47.0   7.0000
2         0       2    male  62.0   9.6875
3         0       3    male  27.0   8.6625
4         1       3  female  22.0  12.2875

In [50]:
inputs=df.drop('Survived',axis=1)
target=df['Survived']

In [51]:
inputs['Sex']=inputs['Sex'].map({'male':1,'female':2})
inputs['Age'].fillna(inputs['Age'].mean(),inplace=True)
inputs['Fare'].fillna(inputs['Fare'].mean(),inplace=True)

In [52]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [53]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  34.5   7.8292
1       3    2  47.0   7.0000
2       2    1  62.0   9.6875
3       3    1  27.0   8.6625
4       3    2  22.0  12.2875

In [66]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train,Y_test=train_test_split(inputs,target,test_size=0.1)

In [67]:
len(X_train)

376

In [68]:
len(X_test)

42

In [69]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

In [70]:
model.fit(X_train,Y_train)

DecisionTreeClassifier()

In [78]:
model.score(X_test,Y_test)

1.0